Repository: rraulesp/django-reportbroD
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es

# lang_change
source: Change Language
es: Cambio de idioma

# app
source: Reports Administration
es: Administración de Reportes

# title
source: Reports
es: Reportes

# nameC
source: Name
es: Nombre

# codec
source: Using code
es: Código de uso

# updatec
source: Modified
es: Modificado

# descc
source: Description
es: Descripción

# btnok
source: Submit
es: Aceptar

source: Actions
es: Acciones

source: Template
es: Plantilla

# back_list
source: Return to the list
es: Volver a la lista

# action_add
source: Add report
es: Agregar reporte

# action_template
source: Update template of report
es: Editar plantilla del reporte

# action_delete
source: Delete report
es: Eliminar reporte

# action_duplicate
source: Duplicate report
es: Duplicar reporte

# action_export
source: Export report
es: Exportar reporte

# action_import
source: Import report
es: Importar reporte

# action_page
source: Page
es: Página

# action_prev
source: Previous
es: Anterior

# action_next
source: Next
es: Siguiente

# msg_noreport
source: There's not report records
es: No se encuentra registrado ningún reporte

# title_add
source: New report registration
es: Registro de nuevo Reporte

# title_add1
source: Creating Report
es: Creando Reporte

# subtitle_add
source: New
es: Nuevo

# unique
source: A report name is repeated. Change it.
es: Ya existe un reporte con el mismo nombre.

# holdern
source: Enter the report's name.
es: Entre el nombre del reporte.

# holderd
source: Provide an overview of the report's function.
es: Provee una reseña sobre la función del reporte.

# holderf
source: Select a JSON template.
es: Selecciona la plantilla JSON

# title_delete
source: Remove report
es: Eliminar reporte

# ask_delete
source: Are you sure to want to delete the report
es: Deseas eliminar el reporte

# action_close
source: Close
es: Cerrar

# title_import
source: Import report
es: Importar reporte

# warn_import
source: The file extension must be .json
es: El fichero debe ser de tipo .json

# title_edit
source: Editing Report
es: Editando Reporte

# template_edit
source: Update template
es: Editar plantilla

# title_import1
source: Import
es: Importar

# especif
source: Template (Format in JSON)
es: Plantilla (Formato en JSON)

# btn_upload
source: Upload
es: Subir

# not_format
source: Format file is not suitable.
es: El archivo no posee el formato adecuado.

# options
source: Main Options
es: Opciones Principales

# opt1
source: Reportbro Admin Documentation
es: Documentación de Reportbro Admin

# opt2
source: Tutorial on ReportBro Designer
es: Tutorial del Diseñador de ReportBro

# opt3
source: Site Administration
es: Administración del Sitio

# opt4
source: Home
es: inicio

# titledoc
source: Documentation
es: Documentación

# titledoc1
source: ReportBro Admin Documentation
es: Documentación de ReportBro Admin

# seccion1
source: What's Reportbro
es: Qué es Reportbro

# seccion2
source: Compatibility
es: Compatibilidad

# seccion3
source: Specifications
es: Especificaciones

# tem1
source: Library of ReportBro Designer
es: Librería del Diseñador de ReportBro

# tem1_parr1
source: Designer is a JavaScript plugin that can be integrated into your web application. Although this requires a little more work at first, having a built-in template design tool has quite a few benefits as you will discover by reading. Installation is simple by including some JavaScript libraries and initializing the Designer with some HTML and JavaScript code.
es: Designer es un plugin JavaScript que se puede integrar en su aplicación web.Aunque esto requiere un poco más de trabajo al principio, tener una herramienta de diseño de plantillas integrada tiene bastantes beneficios como descubrirás leyendo. La instalación es sencilla incluyendo algunas librerías JavaScript e inicializando el Diseñador con algo de código HTML y JavaScript.

# tem1_parr2
source: It is optimized for simple reporting, that is, to display data (text, tabular data, or images) exactly as defined in a design template. All parameters are passed directly to the report and therefore <b>ReportBro </b> does not require knowledge of SQL (or another query language) to create a report. In contrast, using the same data requests in the underlying web application and for reporting eliminates the risk of potential inconsistencies between the data displayed on the screen and the printed report.
es: Está optimizado para informes sencillos, es decir, para mostrar datos (texto, datos tabulares o imágenes) exactamente como se definen en una plantilla de diseño. Todos los parámetros se pasan directamente al informe y, por lo tanto, <b>ReportBro </b> no requiere conocimientos de SQL (u otro lenguaje de consulta) para crear un informe. Por el contrario, el uso de las mismas solicitudes de datos en la aplicación web subyacente y para la generación de informes elimina el riesgo de posibles incoherencias entre los datos mostrados en la pantalla y el informe impreso.

# tem1_parr3
source: <b> ReportBro</b> allows you to easily and quickly design reports with a perfect design. Printing the current page in the footer is as simple as inserting predefined variables for the current page and total page count. Even to generate Excel outputs no additional configuration is needed because ReportBro has a very clear structure and is easy to learn.
es: <b> ReportBro</b> permite diseñar fácil y rápidamente informes con un diseño perfecto. Imprimir la página actual en el pie de página es tan sencillo como insertar variables predefinidas para la página actual y el recuento total de páginas. Incluso para generar salidas Excel no se necesita ninguna configuración adicional debido a que ReportBro tiene una estructura muy clara es fácil de aprender.

# tem2
source: Library of reportbro-lib
es: Libreria reportbro-lib

# tem2_parr1
source: <b> ReportBro-lib</b> is a library for generating PDF and XLSX reports written in Python for use in conjunction with <b>Django</b>. Report templates can be created with <b>ReportBro Designer</b>, a Javascript plugin that can be integrated into your web application.
es: <b> ReportBro-lib</b> es una librería para generar informes PDF y XLSX escrita en python para su uso conjunto con <b>Django</b>. Las plantillas de informes se pueden crear con <b>ReportBro Designer</b>, un plugin Javascript que se puede integrar en su aplicación web.

# tem3
source: ReportBro Admin
es: Administrador de ReportBro

# tem3_parr1
source: <b>A free project that unites the JavaScript libraries of ReportBro designer and the reportbro-lib library.</b>
es: <b>Proyecto libre que une las librerías JavaScript de ReportBro designer y la libreria reportbro-lib.</b>

# tem3_parr2
source: This project is a django app that allows the administration and easy integration of all the libraries related to ReportBro.
es: Este proyecto constituye una app de django que permite la administración y fácil integración de todas las librerías referentes a ReportBro.

# tem21
source: Libraries Used
es: Librerías Utilizadas

# tem21_1parr1
source: ReportBro Designer Javascript
es: Javascript del Diseñador de ReportBro

# tem21_1parr2
source: The free version of <b>ReportBro Designer</b> was used, so only the functions available in that version can be used.
es: Se utilizó la liberia correpondiente a <b>ReportBro Designer</b>en su versión gratuita, por lo tanto solo podrá ser utilizadas las funciones disponibles de esa versión.

# tem21_2parr1
source: Code Reference
es: Referencia de código

# tem21_2parr2
source: <b>This app is an enhanced version of the Albumsreport sample created for ReportBro Designer.</b>
es: <b>Esta app es una versión mejorada del ejemplo de Albumsreport creada para ReportBro Designer.</b>

# tem21_2parr3
source: Original version available in
es: Versión original disponible en

# tem21_3parr2
source: It generates pdf and xlsx reports, Supports (repetitions) header and footer, Allows predefined and own formats for the pages of the report, Uses the elements: Texts, line, image, barcodes, tables, break pages and sections, Allows the stylization of texts and elements and can evaluate expressions and define conditionals.
es: Genera reportes pdf y xlsx , Soporta (repeticiones)cabecera y pie de página, Permite formatos predefinidos y propios para las páginas del reporte, Utiliza los elementos: Textos, línea, imagen, barcodes, tablas, ruptura de páginas y secciones , Permite el estilizado de textos y elementos y puede evaluar expresiones y definir condicionales.

# tem22
source: Supported Databases
es: Bases de Datos Compatibles

# tem22_parr1
source: <b> It supports all adjustable databases for Django: SQLite, Postgres, MySQL, etc</b>
es: <b> Es compatible con todas las bases de datos ajustables para Django: SQLite, Postgres, MySQL, etc</b>

# esp1
source: Data Formats
es: Formato De Datos

# esp1_parr
source: ReportBro reports accept data using a dictionary or context (such as a view function). Each parameter of the context, therefore, is defined with its name (unrepeatable data that must coincide with the one defined during the design of the report) and its information (a text, number, date, image, simple list of elements or objects). Objects within a list must be defined as a dictionary so that the Report can recognize their attributes.
es: Los reportes de ReportBro aceptan los datos mediante un diccionario o un contexto (como una función vista). Cada parámetro del contexto, por lo tanto, se define con su nombre (dato irrepetible y que debe coincidir con el definido durante el diseño del reporte) y su información (un texto, número, fecha, imagen, lista simple de elementos o de objetos.) Los Objetos dentro de una lista se deben definir como un diccionario para que el Reporte puede reconocer sus atributos.

# esp2
source: Export Modes
es: Modos De Exportación

# exp1
source: Export by Code
es: Exportación por Código

# exp2
source: Export by Name
es: Exportación por Nombre

# exp3
source: Export using JSON
es: Exportación usando JSON

# exp1_desc
source: <b>export_report_by_code(template_code, data, extension='pdf', file='report')</b>: This function allows the programmer to render a report (in the database) using mainly its code (record code that is always unique) and the data passed as context.
es: <b>export_report_by_code(template_code, data, extension='pdf', file='reporte')</b>: Esta función permite que el programador pueda renderizar un reporte (en la base de datos) usando principalmente su código (de registro que siempre es único) y los datos pasados como contexto.

# exp2_desc
source: <b>export_report_by_name(template_code, data, extension='pdf', file='report')</b>: This function allows the programmer to render a report (in the database) using mainly its name (record name that will always be unique) and the data passed as context.
es: <b>export_report_by_name(template_code, data, extension='pdf', file='reporte')</b>: Esta función permite que el programador pueda renderizar un reporte (en la base de datos) usando principalmente su nombre (de registro que siempre será único) y los datos pasados como contexto.

# exp3_desc
source: <b>export_report_from_JSON(path_json, data, extension='pdf', file='report')</b>: This feature allows the programmer to render an exported report in a separate JSON file using its specific path and the data passed as context.
es: <b>export_report_from_JSON(path_json, data, extension='pdf', file='reporte')</b>: Esta función permite que el programador pueda renderizar un reporte exportado en un fichero JSON independiente usando su ruta específica y los datos pasados como contexto.

# param
source: Parameters
es: Parámetros

# template_code
source: Use code of the report that was inserted into the database.
es: Código de uso del reporte que fue insertado en la base de datos.

# template_name
source: Name of the report that was inserted into the database.
es: Nombre del reporte que fue insertado en la base de datos.

# path_json
source: Specific path of the JSON-formatted file. (This file is generated with the 'Export' function of this app.) Its relative path can be used depending on the structure of the project.
es: Ruta específica del archivo con formato JSON. (Este fichero se genera con la función de 'Exportación' de esta app). Se puede usar su path relativo según la estructura del proyecto.

# data
source: Context used as a dictionary. This is the information that will be rendered in the report. Each name of the variables in the context must match its equivalent in the parameters defined in the model template design.
es: Contexto pasado como un diccionario. Esta constituye la información que será renderizada en el reporte. Cada nombre de las variables del contexto debe coincidir con su equivalente en los parámetros definidos en el diseño de la plantilla del modelo.

# extension
source: Parameter that supports only two input values (pdf - xlsx). By default it is always pdf. This is the format in which the report will be exported.
es: Parámetro que solo admite dos valores de entrada (pdf - xlsx). Por defecto siempre es pdf. Es el formato con el cual será exportado el reporte.

# file
source: Name of the report file when exported. By default it is set to 'report'.
es: Nombre del fichero del reporte al ser exportado. Por defecto se establece como 'reporte'.

# download
source: If the variable is set to True, the pdf report will be downloaded directly without being viewed, otherwise the pdf will be displayed.
es: Si la variable está en True, el reporte en pdf será descargado directamente sin ser visualizado, en caso contrario el pdf estará mostrado.

# format
source: Format Options
es: Funciones De Formato

# format1
source: Convert to list
es: Convertir a lista

# format2
source: Convert to dictionary
es: Convertir a un diccionario

# format3
source: Adjust Image
es: Ajustar imagen

# convert_list_to_dict
source: <b>convert_list_to_dict()</b>: This helper function receives as a parameter a query made with a database model and converts it into a list or collection of dictionaries to be used by a report. It only allows the conversion of those simple fields.
es: <b>convert_list_to_dict()</b>: Esta función auxiliar recibe como parámetro una Query realizada con un Model de base de datos y lo convierte en una lista o colección de diccionarios para ser utilizada por un reporte. Solo permite la conversión de aquellos campos simples.

# to_dict
source: <b>to_dict()</b>: This helper function can convert each instance of a passed Model class as a parameter into a key-value dictionary understandable by the report. It only allows the conversion of those simple fields.
es: <b>to_dict()</b>: Esta función auxiliar puede convertir cada instancia de un clase Model pasada como parámetro en un diccionario de clave-valor entendible por el reporte. Solo permite la conversión de aquellos campos simples.

# convert_to_base64
source: <b>convert_to_base64(path, format_image)</b>:This function can be used to convert any image to base 64 format. This format is necessary for the image to display smoothly in the report.
es: <b>convert_to_base64(path, format_image)</b>: Esta función puede ser utilizada para convertir una imagen cualquiera a formato base 64. Este formato es necesario para que la imagen se muestre sin problemas en el reporte.

# path
source: Image-specific path. Only its relative path can be used according to the project structure.
es: Ruta específica de la imagen. Solo se puede usar su path relativo según la estructura del proyecto.

# format_image
source: Image format, only allows .png and .jpg
es: Formato de la imagen, solo soportable .png y .jpg

# report_temp
source: Editing report's template
es: Editando plantilla del reporte
